Revit 2027 API
StairsPath.CanCreateOnMultistoryStairs Method
 Checks if more stairs paths can be added on the plan views of a multistory stairs.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool CanCreateOnMultistoryStairs(
	Document document,
	LinkElementId multistoryStairsId
)
Public Shared Function CanCreateOnMultistoryStairs (
	document As Document,
	multistoryStairsId As LinkElementId
) As Boolean
public:
static bool CanCreateOnMultistoryStairs(
	Document^ document,
	LinkElementId^ multistoryStairsId
)
static member CanCreateOnMultistoryStairs :
        document : Document *
        multistoryStairsId : LinkElementId -> bool
Parameters
document Document
multistoryStairsId LinkElementId
 The multistory stairs id.
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
StairsPath Class
Autodesk.Revit.DB.Architecture Namespace